In [1]:
# Data Analysis

import pandas as pd
import numpy as np

# Data Visualization

import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dic = {
    'Name': ["Akshay","Naveena","Nithin","Naina","Tinku","Nainika"],
    'Age': [23,28,30,5,24,6],
    'Gender': ["Male","Female","Male", "Female","Male","Female"],
    'Salary' : [200,300,755,444,288,900]
     }

dic

{'Name': ['Akshay', 'Naveena', 'Nithin', 'Naina', 'Tinku', 'Nainika'],
 'Age': [23, 28, 30, 5, 24, 6],
 'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'],
 'Salary': [200, 300, 755, 444, 288, 900]}

In [40]:
data5 = pd.DataFrame(dic)
data5

      Name  Age  Gender  Salary
0   Akshay   23    Male     200
1  Naveena   28  Female     300
2   Nithin   30    Male     755
3    Naina    5  Female     444
4    Tinku   24    Male     288
5  Nainika    6  Female     900

In [6]:
type(data)

pandas.core.frame.DataFrame

In [7]:
data['Name']

0     Akshay
1    Naveena
2     Nithin
3      Naina
4      Tinku
5    Nainika
Name: Name, dtype: object

In [8]:
data.iloc[0]

Name      Akshay
Age           23
Gender      Male
Salary       200
Name: 0, dtype: object

## Every individual columns and Every individual row of a DataFrame is a series

## Loading the data from a csv file

In [16]:
data = pd.read_csv(r'C:\Users\chiluveru Akshay\Desktop\Data wrangling\DS31032023-main\Data Wrangling & Visualization\20-7-2023\sample data.csv')
data

    Anil  22  25000  M
0  Sunil  24  35000  M
1  Ashok  26  45000  M
2  Seema  28  55000  F
3  Reema  30  65000  F

# Loading the data from a tsv file

In [23]:
data1 = pd.read_csv(r'C:\Users\chiluveru Akshay\Desktop\Data wrangling\DS31032023-main\Data Wrangling & Visualization\20-7-2023\sample-data.tsv',sep = '\t')
data1

,FID,AFFGEOID,TRACTCE,ST,STATE,ST_ABBR,STCNTY,COUNTY,FIPS,LOCATION,...,F_CROWD,F_NOVEH,F_GROUPQ,F_THEME4,F_TOTAL,E_UNINSUR,M_UNINSUR,EP_UNINSUR,MP_UNINSUR,E_DAYPOP
0,-1,1400000US36065023400,23400,36,New York,NY,36065,Oneida,36065023400,"Census Tract 234, Oneida County, New York",...,0,0,1,1,2,154,125,3.6,2.9,10017
1,-1,1400000US36065023501,23501,36,New York,NY,36065,Oneida,36065023501,"Census Tract 235.01, Oneida County, New York",...,0,0,0,0,1,151,100,6.3,4.2,912
2,-1,1400000US36065023502,23502,36,New York,NY,36065,Oneida,36065023502,"Census Tract 235.02, Oneida County, New York",...,0,0,0,0,0,131,85,2.9,1.8,3057
3,-1,1400000US36065023702,23702,36,New York,NY,36065,Oneida,36065023702,"Census Tract 237.02, Oneida County, New York",...,0,0,0,0,0,385,136,10.2,3.6,1407
4,-1,1400000US36065023901,23901,36,New York,NY,36065,Oneida,36065023901,"Census Tract 239.01, Oneida County, New York",...,0,0,0,0,0,165,97,7.2,4.3,1646
5,-1,1400000US36065023902,23902,36,New York,NY,36065,Oneida,36065023902,"Census Tract 239.02, Oneida County, New York",...,0,0,0,0,0,155,77,7.8,3.8,873
6,-1,1400000US36065024000,24000,36,New York,NY,36065,Oneida,36065024000,"Census Tract 240, Oneida County, New York",...,0,0,0,0,0,169,85,3.8,1.9,4696
7,-1,1400000US36065024101,24101,36,New York,NY,36065,Oneida,36065024101,"Census Tract 241.01, Oneida County, New York",...,0,0,0,0,2,93,38,6.3,2.5,921

# Load the Data from Excel file

In [24]:
data2 = pd.read_excel(r'C:\Users\chiluveru Akshay\Desktop\Data wrangling\DS31032023-main\Data Wrangling & Visualization\20-7-2023\Sample data.xlsx')
data2

    Anil  22  25000  M
0  Sunil  24  35000  M
1  Ashok  26  45000  M
2  Seema  28  55000  F
3  Reema  30  65000  F

In [25]:
data2 = pd.read_csv(r'C:\Users\chiluveru Akshay\Desktop\Data wrangling\DS31032023-main\Data Wrangling & Visualization\20-7-2023\baby_names.csv')
data2

      rank       male     female  year
0        1       John       Mary  1880
1        2    William       Anna  1880
2        3      James       Emma  1880
3        4    Charles  Elizabeth  1880
4        5     George     Minnie  1880
...    ...        ...        ...   ...
2815    16      Logan  Elizabeth  2020
2816    17    Jackson      Sofia  2020
2817    18       Levi      Emily  2020
2818    19  Sebastian      Avery  2020
2819    20      Mateo       Mila  2020

[2820 rows x 4 columns]

### Head will display the top 5(default) rows of the file

In [26]:
data2.head()

   rank     male     female  year
0     1     John       Mary  1880
1     2  William       Anna  1880
2     3    James       Emma  1880
3     4  Charles  Elizabeth  1880
4     5   George     Minnie  1880

### Tail will display the bottom 5(default) rows of the file

In [27]:
data2.tail()

      rank       male     female  year
2815    16      Logan  Elizabeth  2020
2816    17    Jackson      Sofia  2020
2817    18       Levi      Emily  2020
2818    19  Sebastian      Avery  2020
2819    20      Mateo       Mila  2020

In [29]:
data.shape

(4, 4)

### To know the number of rows and columns we use shape

In [30]:
data2.shape

(2820, 4)

In [31]:
data2.dtypes

rank       int64
male      object
female    object
year       int64
dtype: object

In [32]:
data2['male']

0            John
1         William
2           James
3         Charles
4          George
          ...
2815        Logan
2816      Jackson
2817         Levi
2818    Sebastian
2819        Mateo
Name: male, Length: 2820, dtype: object

In [33]:
data2.columns

Index(['rank', 'male', 'female', 'year'], dtype='object')

In [34]:
data2.columns.to_list()

['rank', 'male', 'female', 'year']

In [36]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2820 entries, 0 to 2819
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rank    2820 non-null   int64
 1   male    2820 non-null   object
 2   female  2820 non-null   object
 3   year    2820 non-null   int64
dtypes: int64(2), object(2)
memory usage: 88.2+ KB

In [37]:
type(data2)

pandas.core.frame.DataFrame

In [38]:
data

    Anil  22  25000  M
0  Sunil  24  35000  M
1  Ashok  26  45000  M
2  Seema  28  55000  F
3  Reema  30  65000  F

In [41]:
data5

      Name  Age  Gender  Salary
0   Akshay   23    Male     200
1  Naveena   28  Female     300
2   Nithin   30    Male     755
3    Naina    5  Female     444
4    Tinku   24    Male     288
5  Nainika    6  Female     900

In [46]:
column = ['Name','Gender','Salary']
column

['Name', 'Gender', 'Salary']

In [47]:
data5[column]

      Name  Gender  Salary
0   Akshay    Male     200
1  Naveena  Female     300
2   Nithin    Male     755
3    Naina  Female     444
4    Tinku    Male     288
5  Nainika  Female     900

In [51]:
data5[['Name','Gender']]

      Name  Gender
0   Akshay    Male
1  Naveena  Female
2   Nithin    Male
3    Naina  Female
4    Tinku    Male
5  Nainika  Female

In [52]:
data5['Gender']

0      Male
1    Female
2      Male
3    Female
4      Male
5    Female
Name: Gender, dtype: object

In [57]:
data5['Gender'].value_counts()

Male      3
Female    3
Name: Gender, dtype: int64

In [64]:
data5['Gender'].value_counts(normalize = True)

Male      0.5
Female    0.5
Name: Gender, dtype: float64

In [65]:
data5['Gender'].value_counts(normalize = True) * 100

Male      50.0
Female    50.0
Name: Gender, dtype: float64

In [66]:
data5

      Name  Age  Gender  Salary
0   Akshay   23    Male     200
1  Naveena   28  Female     300
2   Nithin   30    Male     755
3    Naina    5  Female     444
4    Tinku   24    Male     288
5  Nainika    6  Female     900

In [69]:
data5.iloc[3]

Name       Naina
Age            5
Gender    Female
Salary       444
Name: 3, dtype: object